Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA1_DFP/2.1.51/samha1ab/atdf/ATSAMHA1G15AB.atdf
      <value-group name="SYSCTRL_OSC32K__STARTUP">
        <value name="CYCLE3" caption="0.092 ms" value="0"/>
        <value name="CYCLE4" caption="0.122 ms" value="1"/>
        <value name="CYCLE6" caption="0.183 ms" value="2"/>
        <value name="CYCLE10" caption="0.305 ms" value="3"/>
        <value name="CYCLE18" caption="0.549 ms" value="4"/>
        <value name="CYCLE34" caption="1.038 ms" value="5"/>
        <value name="CYCLE66" caption="2.014 ms" value="6"/>
        <value name="CYCLE130" caption="3.967 ms" value="7"/>
      </value-group>
      <value-group name="SYSCTRL_XOSC32K__STARTUP">
        <value name="CYCLE1" caption="0.122 ms" value="0"/>
        <value name="CYCLE32" caption="1.068 ms" value="1"/>
        <value name="CYCLE2048" caption="62.592 ms" value="2"/>
        <value name="CYCLE4096" caption="125.092 ms" value="3"/>
        <value name="CYCLE16384" caption="500.092 ms" value="4"/>
        <value name="CYCLE32768" caption="1000.092 ms" value="5"/>
        <value name="CYCLE65536" caption="2000.092 ms" value="6"/>
        <value name="CYCLE131072" caption="4000.092 ms" value="7"/>
      </value-group>
      <value-group name="SYSCTRL_DPLLCTRLB__FILTER">
        <value name="DEFAULT" caption="Default filter mode" value="0x0"/>
        <value name="LBFILT" caption="Low bandwidth filter" value="0x1"/>
        <value name="HBFILT" caption="High bandwidth filter" value="0x2"/>
        <value name="HDFILT" caption="High damping filter" value="0x3"/>
      </value-group>
      <value-group name="SYSCTRL_DPLLCTRLB__LTIME">
        <value name="DEFAULT" caption="No time-out" value="0x0"/>
        <value name="8MS" caption="Time-out if no lock within 8 ms" value="0x4"/>
        <value name="9MS" caption="Time-out if no lock within 9 ms" value="0x5"/>
        <value name="10MS" caption="Time-out if no lock within 10 ms" value="0x6"/>
        <value name="11MS" caption="Time-out if no lock within 11 ms" value="0x7"/>
      </value-group>
      <value-group name="SYSCTRL_DPLLCTRLB__REFCLK">
        <value name="REF0" caption="CLK_DPLL_REF0 clock reference" value="0x0"/>
        <value name="REF1" caption="CLK_DPLL_REF1 clock reference" value="0x1"/>
        <value name="GCLK" caption="GCLK_DPLL clock reference" value="0x2"/>
      </value-group>
    </module>
    <module name="TC" id="U2212" version="1.3.1" caption="Basic Timer Counter">
      <register-group name="TC" caption="Basic Timer Counter">
        <mode name="COUNT8" qualifier="TC.CTRLA.MODE" value="1" caption="8-bit Counter Mode"/>
        <mode name="COUNT16" qualifier="TC.CTRLA.MODE" value="0" caption="16-bit Counter Mode"/>
        <mode name="COUNT32" qualifier="TC.CTRLA.MODE" value="2" caption="32-bit Counter Mode"/>
        <register name="CTRLA" offset="0x0" rw="RW" size="2" initval="0x0000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="TC Mode" mask="0xC" values="TC_CTRLA__MODE"/>
          <bitfield name="WAVEGEN" caption="Waveform Generation Operation" mask="0x60" values="TC_CTRLA__WAVEGEN"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TC_CTRLA__PRESCALER"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization" mask="0x3000" values="TC_CTRLA__PRESCSYNC"/>
        </register>
        <register name="READREQ" offset="0x2" rw="RW" size="2" initval="0x0000" caption="Read Request">
          <bitfield name="ADDR" caption="Address" mask="0x1F"/>
          <bitfield name="RCONT" caption="Read Continuously" mask="0x4000"/>
          <bitfield name="RREQ" caption="Read Request" mask="0x8000"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" size="1" atomic-op="clear:CTRLBCLR" initval="0x02" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xC0" values="TC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="CMD" caption="Command" mask="0xC0" values="TC_CTRLBSET__CMD"/>
        </register>
        <register name="CTRLC" offset="0x6" rw="RW" size="1" initval="0x00" caption="Control C">
          <bitfield name="INVEN0" caption="Output Waveform 0 Invert Enable" mask="0x1"/>
          <bitfield name="INVEN1" caption="Output Waveform 1 Invert Enable" mask="0x2"/>
          <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x10"/>
          <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x20"/>
        </register>
        <register name="DBGCTRL" offset="0x8" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Run Mode" mask="0x1"/>
        </register>
        <register name="EVCTRL" offset="0xA" rw="RW" size="2" initval="0x0000" caption="Event Control">
          <bitfield name="EVACT" caption="Event Action" mask="0x7" values="TC_EVCTRL__EVACT"/>
          <bitfield name="TCINV" caption="TC Inverted Event Input" mask="0x10"/>
          <bitfield name="TCEI" caption="TC Event Input" mask="0x20"/>
          <bitfield name="OVFEO" caption="Overflow/Underflow Event Output Enable" mask="0x100"/>
          <bitfield name="MCEO0" caption="Match or Capture Channel 0 Event Output Enable" mask="0x1000"/>
          <bitfield name="MCEO1" caption="Match or Capture Channel 1 Event Output Enable" mask="0x2000"/>
        </register>
        <register name="INTENCLR" offset="0xC" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTENSET" offset="0xD" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="OVF" caption="Overflow Interrupt Enable" mask="0x1"/>
          <bitfield name="ERR" caption="Error Interrupt Enable" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready Interrupt Enable" mask="0x8"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0 Interrupt Enable" mask="0x10"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1 Interrupt Enable" mask="0x20"/>
        </register>
        <register name="INTFLAG" offset="0xE" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="OVF" caption="Overflow" mask="0x1"/>
          <bitfield name="ERR" caption="Error" mask="0x2"/>
          <bitfield name="SYNCRDY" caption="Synchronization Ready" mask="0x8"/>
          <bitfield name="MC0" caption="Match or Capture Channel 0" mask="0x10"/>
          <bitfield name="MC1" caption="Match or Capture Channel 1" mask="0x20"/>
        </register>
